FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ПрайсЛистыКонтрагентовЖурналЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовЖурналЗагрузки</Name>
			<Comment>Журнал загрузки прайс-листов контрагентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус загрузки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗагрузкиПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Comment>Строка подключения к прайс-листу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Comment>Дата файла или письма</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешФайла</Name>
					<Comment>Хеш файла или идентификатор письма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Примечание к статусу загрузки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогЗагрузки</Name>
					<Comment>Лог загрузки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОЗагрузке</Name>
					<Comment>Информация о загрузке</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Comment>Идентификатор фонового задания</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор изменения состояния</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ПрайсЛистыКонтрагентовЖурналЗагрузки/Ext/ManagerModule.bsl
Функция СформироватьСтруктуруЖурналаЗагрузки() Экспорт
	
	СтруктураЖурнала = Новый Структура;
	
	ЛогЗагрузки = Новый Структура;
	ЛогЗагрузки.Вставить("Кратко", "");
	ЛогЗагрузки.Вставить("Старт", "Старт загрузки: " + Формат(ТекущаяДата(), "ДФ='yyyy.MM.dd ЧЧ:мм:сс'"));
	ЛогЗагрузки.Вставить("Финиш", "");
	
	ИнформацияОЗагрузке = Новый Структура;
	
	СтруктураЖурнала.Вставить("Период", ТекущаяДата());
	СтруктураЖурнала.Вставить("Статус", Перечисления.СтатусыЗагрузкиПрайсЛистов.ПустаяСсылка()); 
	СтруктураЖурнала.Вставить("СтрокаПодключения", "");
	СтруктураЖурнала.Вставить("ДатаФайла", Дата("00010101"));
	СтруктураЖурнала.Вставить("ХешФайла", "");
	СтруктураЖурнала.Вставить("Примечание", "");
	СтруктураЖурнала.Вставить("ЛогЗагрузки", ЛогЗагрузки);
	СтруктураЖурнала.Вставить("ИнформацияОЗагрузке", ИнформацияОЗагрузке);
	СтруктураЖурнала.Вставить("ИдентификаторФоновогоЗадания", "");
	СтруктураЖурнала.Вставить("Автор", "");
	
	Возврат СтруктураЖурнала;
КонецФункции //СформироватьСтруктуруЖурналаЗагрузки()

Процедура СохранитьЖурналЗагрузкиПрайсЛиста(ЖурналЗагрузки, ПрайсЛист)Экспорт 
	
	Если ЖурналЗагрузки.Статус = Перечисления.СтатусыЗагрузкиПрайсЛистов.Завершена Тогда
		//НЕОБХОДИМО ДОБАВИТЬ ФОРМИРОВАНИЕ СТАТИСТИКИ ДЛЯ ЗАПИСИ В РЕГИСТР !!!!!!
	КонецЕсли;
	
	Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовЖурналЗагрузки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, ЖурналЗагрузки);
	Менеджер.ПрайсЛист = ПрайсЛист;
	Менеджер.ЛогЗагрузки = Новый ХранилищеЗначения(ЖурналЗагрузки.ЛогЗагрузки);
	Менеджер.ИнформацияОЗагрузке = Новый ХранилищеЗначения(ЖурналЗагрузки.ИнформацияОЗагрузке);
	Попытка
		Менеджер.Автор = ПараметрыСеанса.Пользователь;
	Исключение
		Менеджер.Автор = Справочники.Пользователи.Робот; // Фоновое задание
	КонецПопытки;
	
	Менеджер.Записать();
	
КонецПроцедуры //СохранитьЖурналЗагрузкиПрайсЛиста()

Процедура УдалитьЗаписиСтаршеДаты(ПрайсЛист=Неопределено, Дата) Экспорт 
	 //Получим ключи всех записей старше переданной даты
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЖурналЗагрузки.Период,
	 |	ЖурналЗагрузки.ПрайсЛист
	 |ИЗ
	 |	РегистрСведений.ПрайсЛистыКонтрагентовЖурналЗагрузки КАК ЖурналЗагрузки
	 |ГДЕ
	 |	ЖурналЗагрузки.Период < &Дата
	 |	"+?(обЗначениеНеЗаполнено(ПрайсЛист), "", "И ЖурналЗагрузки.ПрайсЛист = &ПрайсЛист")+"
	 |";
	 
	 Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	 Запрос.УстановитьПараметр("Дата", Дата);
	 
	 Результат = Запрос.Выполнить();
	 Если Результат.Пустой() Тогда
		 Возврат;
	 КонецЕсли;
	 
	 НачатьТранзакцию();
	 
	 Блокировка = Новый БлокировкаДанных;
	 ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовЖурналЗагрузки");
	 ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	 ЭлементБлокировки.ИсточникДанных = Результат;
	 ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Период", "Период");
	 ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПрайсЛист", "ПрайсЛист");
	 Блокировка.Заблокировать();
	 
	 Выборка = Результат.Выбрать();
	 КоличествоЗаписей = Выборка.Количество();
	 СЧ = 0;
	 Пока Выборка.Следующий() Цикл
		 СЧ = СЧ + 1;
		 #Если Клиент Тогда
			 Состояние(НСтр("ru='Очистка журнала загрузки: '") + Строка(Цел(СЧ*100/КоличествоЗаписей))+"%");
		 #КонецЕсли
		 
		 НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовЖурналЗагрузки.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		 НаборЗаписей.Отбор.ПрайсЛист.Установить(Выборка.ПрайсЛист);
		 
		 НаборЗаписей.Прочитать();
		 НаборЗаписей.Очистить();
		 Попытка
			 НаборЗаписей.Записать();
		 Исключение
			 ОтменитьТранзакцию();
			 #Если Клиент Тогда
				 ТекстСообщения = НСтр("ru='Не удалось очистить журнал загрузки прайс-листов по пречине: '") + ИнформацияОбОшибке().Описание;
				 Сообщить(ТекстСообщения,СтатусСообщения.Важное);
			 #КонецЕсли
			 Прервать;
		 КонецПопытки;
	 КонецЦикла;
	 Если ТранзакцияАктивна()Тогда
		 ЗафиксироватьТранзакцию();
		 #Если Клиент Тогда
			 ТекстСообщения = НСтр("ru='Записи журнала загрузки прайс-листов старше '") + Формат(Дата,"ДЛФ=DD") + НСтр("ru=' успешно удалены.'");
			 Сообщить(ТекстСообщения);
		 #КонецЕсли
	 КонецЕсли;	 
	 
КонецПроцедуры //УдалитьЗаписиСтаршеДаты()
